#Web:已连接为中心的系统

#语义网：从链接文本到链接数据
#文本的链接web of Texts-->web of objects,web of datas,web of Things
#事物之间有多种类型的链接(country.jpg)

#谷歌知识图谱：Things not strings---数据更加结构化、组织更加完美
#搜索结果中体现关联（Facebook兴趣图谱）

#KG概念演化：
#1960（语义网络）：作为知识表示的一种方法被提出，主要用于自然语言理解领域。
#1980（本体论）：哲学概念‘本体’被引入到人工智能领域用来刻画知识。
#1989（Web）：发明了万维网，Linked Information System
#1998（The Semantic Web）：从超文本链接到语义链接
#2006(Linked Data)：链接数据，Tim 突出语义网的本质是要建立数据之间的链接
#2012（知识图谱）：谷歌发布了基于知识图谱的搜索引擎产品。

#知识表示和知识库
#知识表示方法：框架系统，产生式规则，描述逻辑
#知识图谱得益于Web的发展（更多的是数据层面），有着来源于KR.NLP,WEB,AI的多个方面的基因。

#KG功能：
#1.KG辅助搜索：web的思想是万物的链接，搜索的理想是事务的搜索
# 2.辅助问答
# 3.辅助决策
# 4.辅助AI:常识推理

